[
    {
        "name":"Leading Computer, Laptop & Gaming PC Retail & Online Shop in Bangladesh",
        "desc":"Technology has become a part of our daily lives and for a huge portion of our life, we are dependent on tech products daily. There is hardly a home in Bangladesh without a tech product. This is where we come in. Star Tech & Engineering Ltd had started as a Tech product shop way back in March 2007. We focused on giving the customers the best service possible. This is why Star Tech is one of The most trusted names in the tech industry of Bangladesh today. After a long 15-year journey; Star Tech & Engineering Ltd. was certified with the renowned 'ISO 9001:2015 certification' because of the best Quality control management system. As an 'ISO 9001:2015 certified' organization; Star Tech & Engineering Ltd. is now up to the international standard that specifies a quality management system (QMS). This Certification denotes that this organization consistently maintains all sorts of regulatory requirements to provide products and services for meeting all sorts of customer requirements."
    },
    {
        "name":"Best Laptop Shop in Bangladesh",
        "desc":"Desktop PCs are a vital part of any workspace or gaming setup. It does not matter if you are an entry-level, mid-level, or high-performance user. If you will be using your PC to run the resource-demanding apps consistently, then Desktop PC is the best solution. You can easily buy your desired Brand PC, Portable mini PC, All-In-One PC, Apple Mac mini or iMac PC, or any budget pc. You can get your new Intel Desktop PC, AMD Desktop PC, or custom Desktop PC very easily with the PC builder feature from our E-commerce website or any of our shops. If you are a gamer or professional content creator then you can enhance your productivity with our collections of hi-end gaming and rendering PCs."
    },
    {
        "name":"Best Desktop PC Shop in Bangladesh",
        "desc":"Desktop PCs are a vital part of any workspace or gaming setup. It does not matter if you are an entry-level, mid-level, or high-performance user. If you will be using your PC to run the resource-demanding apps consistently, then Desktop PC is the best solution. You can easily buy your desired Brand PC, Portable mini PC, All-In-One PC, Apple Mac mini or iMac PC, or any budget pc. You can get your new Intel Desktop PC, AMD Desktop PC, or custom Desktop PC very easily with the PC builder feature from our E-commerce website or any of our shops. If you are a gamer or professional content creator then you can enhance your productivity with our collections of hi-end gaming and rendering PCs."
    },
    {
        "name":"Best PC component & accessories Shop in Bangladesh",
        "desc":"For any PC enthusiast out there; it is easy to get a custom PC with your chosen components from Star Tech. You can even choose accessories as per your preference to garnish your PC. So it means you can choose the main components like the Processor (CPU), Monitor, Motherboard, Graphics Card, SSD, HDD, RAM, Casing, Cooler, Power supply (PSU), etc. Or any other accessories for PC like Keyboard, mouse, mousepad, headphones, webcam, capture card, etc with extensive features like RGB lighting to give your PC gaming vibe. The best part is, you can change any of your preferred components or accessories before the final purchase; whether you are buying from Star tech’s Physical Store or Online Shop."
    },
    {
        "name":"Best Gaming Shop in Bangladesh",
        "desc":"Gaming is one of the most popular forms of entertainment now. We aim to provide the best selection of Gaming Desktop PC, gaming laptops, and gaming consoles. We also have other gaming components like the gaming motherboard, Liquid cooler, Cooler fan, gaming casing, hi-performance RAMKit, Graphics card, etc. Gamers can accessorize their gaming setup with various accessories like gaming mouse, keyboard, mousepad, headphones, gamepad, RGB light-strips, etc. apart from these regular ones we have some special gaming-focused accessories like gaming chairs, gaming desks, gaming Sofa, RGB mousepad. We have a strategic partnership with some known gaming brands like Razer, Antec, Gamdias, and Asus. As for the other brand coverage, we have gaming products from all other popular brands like A4Tech Bloody, ASRock, SteelSeries, Logitech, Corsair, Redragon, Coolermaster, Fantech, Cougar, Zadak, Gigabyte, Elgato, and many more."
    },
    {
        "name":"Best Office Equipment shop in Bangladesh",
        "desc":"Modern-day office space has gotten various iterations in the form of a home office, Startup workspace, and so on. Tech products are a staple for home offices, startups, and regular offices. Star Tech delivers office equipment like laptops, desktops, routers, printers, Photocopiers, Conference Systems, attendance machines, Server equipment, and other must-have products to run an office properly."
    },
    {
        "name":"Best E-commerce Shop to order your desired Product",
        "desc":"Star Tech always prioritizes its customers and to ensure better customer service started the e-commerce shop in addition to the physical stores. The goal was to meet more customer needs in the shortest time. Since then, We have had the top spot as the best E-commerce shop in Bangladesh. Our website has a comprehensive search option to find the desired product. Our website has a unique PC builder feature so that you can build a Custom PC with your desired components. We arrange many promotional campaigns on different occasions and also on a regular basis. Some of our most successful events are named Flash sale, Special offer, Thursday Thunder, Anniversary Special Offer, New Year Offer, 12.12 Campaign, and many more. We even arrange special gaming events and tournaments for Bangladeshi gamers with renowned gaming Brands like Razer and Asus ROG."
    },
    {
        "name":"Best Price, Product & After-sales service",
        "desc":"Star Tech has taken care of its customers since the beginning. No matter if someone is inquiring or purchasing; every customer wants to get a genuine product with the best price. We deliver their desired products at the best price in the market for both online or physical stores. Apart from that, we offer the most extensive range of pre-sale and post-purchase product support and after-sales service. To ensure customer satisfaction with product and service We have branches in major cities like Dhaka, Chittagong, Rangpur, Gazipur, and Khulna. The plan of establishing our branches in other cities is already in motion. Hopefully, we will be available in all the districts in the very near future. Currently, we have online delivery available in all 64 districts in Bangladesh."
    }
]